app/views/professors/show.html.erb

SELECT  1 AS one FROM "reviews" WHERE "reviews"."professor_id" = ? LIMIT 1  [["professor_id", 3]]
---
  <div class="col-md-8">
    <% if @professor.reviews.any? %>