app/controllers/reviews_controller.rb

  def create
    @professor = Professor.find_by(netid: params[:review][:professor_netid].downcase)
    if @professor
      @review = @professor.reviews.build(review_params)
      if @review.save
---
SELECT  "professors".* FROM "professors" WHERE "professors"."netid" = ? LIMIT 1  [["netid", "sbhatt"]]
INSERT INTO "reviews" ("student_netid", "student_class", "professor_netid", "relationship", "availability", "responsiveness", "knowledge", "organization", "friendliness", "helpfulness", "comments", "professor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    review = Review.find(params[:id])
    @professor = review.professor
    review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ?  ORDER BY "reviews"."created_at" DESC LIMIT 1  [["id", 13]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 13]]