app/controllers/users_controller.rb

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Foo Bar"], ["email", "foo@bar.com"], ["updated_at", "2015-04-09 16:01:26.338881"], ["id", 762146111]]